{
  "backend/main.mo": "Main actor defining data types (Seller, Product, Review, UserProfile) and CRUD operations with role-based access control (admin/user permissions) for sellers, products, reviews, and user profiles, including mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs, documenting landing page, catalog, product detail, checkout, and admin functionality with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose, from routing and queries to admin panels and theme configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode color tokens for background, foreground, borders, and semantic colors.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, catalog, product detail, checkout, and admin pages, wrapped in ThemeProvider and QueryClientProvider with Layout and Toaster.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for creating/editing products with fields for name, description, price, seller, images (with upload progress), trade-offs, and return reasons. Handles image uploads using ExternalBlob with progress tracking.",
  "frontend/src/components/admin/ReviewForm.tsx": "Form component for creating/editing product reviews with fields for product selection, user ID, rating (1-5), usage days, review content, and verified status checkbox.",
  "frontend/src/components/admin/SellerForm.tsx": "Form component for creating/editing seller profiles with fields for name, trust score, account age, order statistics, dispute records, policy violations, penalties, and history timeline.",
  "frontend/src/components/Footer.tsx": "Footer component displaying transparency policy links, contact information, copyright notice, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header with NISHQ logo, navigation links (home, catalog, admin routes for admins), Internet Identity authentication button, theme toggle, and responsive mobile menu.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component providing consistent page structure with Header, main content area, and Footer.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using next-themes, displaying animated sun and moon icons.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including products, sellers, reviews, user profiles, and admin status checks, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for backgrounds, borders, charts, and trust indicators using a neutral professional palette with soft green accents.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient, InternetIdentityProvider, and App wrapped in their respective providers.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin-only page for managing products with search functionality, product list display, and dialog form to add new products with seller assignment.",
  "frontend/src/pages/admin/AdminReviewsPage.tsx": "Admin page for managing reviews with search, filtering, and add review dialog. Includes admin access check, displays review list with verification status badges, and integrates ReviewForm component.",
  "frontend/src/pages/admin/AdminSellersPage.tsx": "Admin page for managing sellers with search functionality and add seller dialog. Features admin access control, seller list display with trust scores, and integrates SellerForm component.",
  "frontend/src/pages/CatalogPage.tsx": "Displays a grid of all products with trust indicators including fake review risk, return percentages, seller trust scores, and account age; clicking a product navigates to its detail page.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles secure checkout flow with shipping form, order summary showing price breakdown with tax and delivery, escrow payment information, and order confirmation with refund timeline.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, trust signal cards highlighting verified reviews and transparent seller history, and explanation of why NISHQ exists to optimize for trust over sales.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information including images, description, pricing breakdown, trust metrics (seller score, account age, return rate, fake review risk), verified reviews, and checkout button.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing. Includes sessionStorage integration for parameter persistence and hash cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography, container queries, animations, and custom design tokens for the NISHQ platform.",
  "project_state.json": "Project metadata defining NISHQ as a trust-first Indian e-commerce platform with architectural notes, feature list, and image requirements. Documents MVP scope including user flows, admin panel, and review verification system."
}